/**
 * Created by Administrator on 2018/6/21.
 */
module.exports = {
    0: "success",
    1: "系统异常",
    2: "%s",
    3: "Redis出错",
    4: "Mongodb出错",
    5: "Leveldb出错",
    6: "http post出错",
    7: "http get出错",
    8: "二维码生成出错",
    9: "elasticsearch error",
    20: "加密出错",
    21: "验证码出错",
    22: "验证码重新分配",
    23: "token失效",

    40: "token不存在",
    41: "非法token",
    42: "token过期",
    43: "设备号非法",
    44: "群发消息不能为空",
    45: "房间号不能空",
    46: "用户名不能为空",
    47: "消息内容不能为空",

    100: "------------------------[user]------------------------",
    101: "您没有权限",
    102: "该文化节目不存在",
    103: "该手机号码已经注册",
    104: "验证码发送已满3次",
    105: "注册失败",
    106: "取消失败",
    107: "场馆不存在",
    108: "区域未配置",
    109: "预订活动失败",
    110: "提求参数为空",
    111: "详情接口出错",

    400: "------------------------[admin]------------------------",
    401: "您没有权限",


    700:"------------------------[web]------------------------",

}